public_html/intranet/app/controllers/capa_controller.rb

	def index
		@folheto = Folheto.last
		@noticias = Post.order('data DESC').where(:kind_of_post_id => "1", inativar: false).page(params[:page]).per(3)
---
SELECT  "folhetos".* FROM "folhetos"  ORDER BY "folhetos"."id" DESC LIMIT 1
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" WHERE "posts"."kind_of_post_id" = ? LIMIT 3 OFFSET 0) subquery_for_count  [["kind_of_post_id", 1]]