public_html/app/controllers/capa_controller.rb

	def index
		@folheto = Folheto.last
---
SELECT  "folhetos".* FROM "folhetos"  ORDER BY "folhetos"."id" DESC LIMIT 1